In [1]:
import pandas as pd

In [2]:
data=pd.read_csv("supermarket.csv")

In [105]:
pd.unique(data[ 'Product']).shape

(137,)

In [45]:
data.head()

    Customer Id        Date           Product
0  JKML5ZWXP0XQ  2020-07-20    tropical fruit
1  YOGWQIUPDAJ7  2020-04-30        whole milk
2  Q3NL22281AF6  2020-09-18         pip fruit
3  C59GRTLMZQAU  2020-12-11  other vegetables
4  WUSF8LTEQZ5L  2020-01-02        whole milk

In [227]:
data['Date']=pd.to_datetime(data['Date'])

In [215]:
s1=data.sort_values(by='Date')

In [216]:
s1.head()

        Customer Id        Date                Product
27799  KCTZ72QHMDFI  2019-01-01  Instant food products
13034  Y0P0N0Q7J20N  2019-01-01    specialty chocolate
25842  3K6D758U6XEW  2019-01-01      frozen vegetables
8096   4HQQAPAPG6SF  2019-01-01           citrus fruit
21803  XF4DEN65CUZO  2019-01-01       other vegetables

In [112]:
s1["new"]=1
s1.head()

        Customer Id       Date                Product  new
24743  3KDYM2HVF073 2019-12-10  Instant food products    1
32467  5WEVE9KL8TIT 2019-07-23  Instant food products    1
15793  UD64RW6MHI2H 2020-07-28  Instant food products    1
30474  0AGOEFY8O0XQ 2020-10-18  Instant food products    1
4217   3343PDWHXIRN 2020-07-02  Instant food products    1

In [109]:
s1.groupby(["Date"]).sum().mean().apply(lambda x: round(x,2))

new    44.93
dtype: float64

In [110]:
s1=data.sort_values(by='Product')

In [127]:
s1.head()

        Customer Id       Date                Product  new
24743  3KDYM2HVF073 2019-12-10  Instant food products    1
32467  5WEVE9KL8TIT 2019-07-23  Instant food products    1
15793  UD64RW6MHI2H 2020-07-28  Instant food products    1
30474  0AGOEFY8O0XQ 2020-10-18  Instant food products    1
4217   3343PDWHXIRN 2020-07-02  Instant food products    1

In [131]:
s2=pd.DataFrame(s1.groupby(["Product"]).sum())
s3=s2.sort_values(by="new").head(4)

In [132]:
s3.T.columns

Index(['kitchen utensil', 'preservation products', 'baby cosmetics', 'bags'], dtype='object', name='Product')

In [133]:
s3

                       new
Product
kitchen utensil          1
preservation products    1
baby cosmetics           3
bags                     4

<h3>جواب 4</h3>

In [217]:
s2=s1["Date"].apply(lambda x:x if ("2020" in x) else 0)

In [218]:
s1["Date"]=s2
s3=s1[s1["Date"] != 0]

In [219]:
s3["New"]=1

C:\Users\Mehrdad\AppData\Local\Temp\ipykernel_1780\1559669581.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  s3["New"]=1

In [220]:
s4=s3.groupby(["Customer Id"]).sum()

In [221]:
s4.sort_values(by="New").tail(10)

              New
Customer Id
MEWMJVZWOVF0   18
QBUS9NZY39BE   19
KE1JWTCQMDSD   19
E7FD9BU4OK0F   19
3HRBE45N5NB6   20
NQQZGF4K1FE0   20
ED8WY0DE27XG   20
0P1TPIH74E79   21
KACGV5OJXMJW   23
0ZRF32AJ06BC   26

In [207]:
s4.T

AttributeError: 'DataFrameGroupBy' object has no attribute 'T'

In [222]:
from datetime import datetime

In [233]:
data["week"]=data["Date"].apply(lambda x: x.weekday())

In [235]:
data["new"]=1

In [242]:
d2=pd.DataFrame(data.groupby(["week"]).sum())

In [240]:
d2.sort_values(by="new")

       new
week
6     4480
4     4539
3     4614
0     4655
5     4774
1     4802
2     4846